resources/xmlfiles/taxlink/ar-invoicetaxonly.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.vertexinc.com/vertextl/taxIntegration/types/">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:MessageID>uuid:d89d76f2-0bd3-4404-bf26-a1df7ec8fb5e</wsa:MessageID>
		<wsa:Action>calculation</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<typ:calculation>
			<typ:trxHeader>
				<typ:ApplicationId>222</typ:ApplicationId>
				<typ:ApplicationShortname>AR</typ:ApplicationShortname>
				<typ:BatchSourceName>Manual</typ:BatchSourceName>
				<typ:CtrlHdrTxApplFlag>N</typ:CtrlHdrTxApplFlag>
				<typ:DefaultTaxationCountry>US</typ:DefaultTaxationCountry>
				<typ:DocEventStatus>VALIDATED_FOR_TAX</typ:DocEventStatus>
				<typ:EntityCode>TRANSACTIONS</typ:EntityCode>
				<typ:EventClassCode>INVOICE</typ:EventClassCode>
				<typ:EstablishmentId>300000001140071</typ:EstablishmentId>
				<typ:EstablishmentNumber>1004</typ:EstablishmentNumber>
				<typ:EventClassMappingId>4</typ:EventClassMappingId>
				<typ:EventTypeCode>INV_UPDATE</typ:EventTypeCode>
				<typ:EndPointUrl>https://ecog-test.fa.us2.oraclecloud.com</typ:EndPointUrl>
				<typ:FirstPtyOrgId>300000004221936</typ:FirstPtyOrgId>
				<typ:HdrTrxUserKey1>CALCULATE</typ:HdrTrxUserKey1>
				<typ:HistoricalFlag>N</typ:HistoricalFlag>
				<typ:HqEstbPartyTaxProfId>300000001140209</typ:HqEstbPartyTaxProfId>
				<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
				<typ:LedgerId>300000001139008</typ:LedgerId>
				<typ:LegalEntityId>300000001140053</typ:LegalEntityId>
				<typ:LegalEntityNumber>RIUS104111</typ:LegalEntityNumber>
				<typ:LogLevel>SEVERE</typ:LogLevel>
				<typ:ReceivablesTrxTypeSeqId>34</typ:ReceivablesTrxTypeSeqId>
				<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
				<typ:TrxDate>2022-09-30</typ:TrxDate>
				<typ:TrxDueDate>2022-06-11</typ:TrxDueDate>
				<typ:TrxId>593479</typ:TrxId>
				<typ:TrxLevelType>MISC</typ:TrxLevelType>
				<typ:TrxNumber>AUTOTST_ARINVTAXONLY_15664</typ:TrxNumber>
			</typ:trxHeader>
			<typ:trxLineList>
				<typ:trxLine>
					<typ:AccountCcid>14028</typ:AccountCcid>
					<typ:ApplicationId>222</typ:ApplicationId>
					<typ:AccountString>3211-50-42125-000-0000-0000</typ:AccountString>
					<typ:AssessableValue>0</typ:AssessableValue>
					<typ:BillFromGeographyType1>ADDRESS1</typ:BillFromGeographyType1>
					<typ:BillFromGeographyType10>PROVINCE</typ:BillFromGeographyType10>
					<typ:BillFromGeographyType2>ADDRESS2</typ:BillFromGeographyType2>
					<typ:BillFromGeographyType3>ADDRESS3</typ:BillFromGeographyType3>
					<typ:BillFromGeographyType4>ADDRESS4</typ:BillFromGeographyType4>
					<typ:BillFromGeographyType5>COUNTRY</typ:BillFromGeographyType5>
					<typ:BillFromGeographyType6>STATE</typ:BillFromGeographyType6>
					<typ:BillFromGeographyType7>COUNTY</typ:BillFromGeographyType7>
					<typ:BillFromGeographyType8>CITY</typ:BillFromGeographyType8>
					<typ:BillFromGeographyType9>POSTALCODE</typ:BillFromGeographyType9>
					<typ:BillFromGeographyValue1>5430 One Shields Avenue</typ:BillFromGeographyValue1>
					<typ:BillFromGeographyValue5>US</typ:BillFromGeographyValue5>
					<typ:BillFromGeographyValue6>Pennsylvania</typ:BillFromGeographyValue6>
					<typ:BillFromGeographyValue8>Berwyn</typ:BillFromGeographyValue8>
					<typ:BillFromGeographyValue9>19312</typ:BillFromGeographyValue9>
					<typ:BillFromLocationId>300000001141673</typ:BillFromLocationId>
					<typ:BillThirdPtyAcctId>300000005514504</typ:BillThirdPtyAcctId>
					<typ:BillThirdPtyAcctSiteId>300000005514533</typ:BillThirdPtyAcctSiteId>
					<typ:BillToGeographyType1>ADDRESS1</typ:BillToGeographyType1>
					<typ:BillToGeographyType10>PROVINCE</typ:BillToGeographyType10>
					<typ:BillToGeographyType2>ADDRESS2</typ:BillToGeographyType2>
					<typ:BillToGeographyType3>ADDRESS3</typ:BillToGeographyType3>
					<typ:BillToGeographyType4>ADDRESS4</typ:BillToGeographyType4>
					<typ:BillToGeographyType5>COUNTRY</typ:BillToGeographyType5>
					<typ:BillToGeographyType6>STATE</typ:BillToGeographyType6>
					<typ:BillToGeographyType7>COUNTY</typ:BillToGeographyType7>
					<typ:BillToGeographyType8>CITY</typ:BillToGeographyType8>
					<typ:BillToGeographyType9>POSTALCODE</typ:BillToGeographyType9>
					<typ:BillToGeographyValue1>32 Avenue Of The Americas</typ:BillToGeographyValue1>
					<typ:BillToGeographyValue5>US</typ:BillToGeographyValue5>
					<typ:BillToGeographyValue6>New York</typ:BillToGeographyValue6>
					<typ:BillToGeographyValue7>New York</typ:BillToGeographyValue7>
					<typ:BillToGeographyValue8>New York</typ:BillToGeographyValue8>
					<typ:BillToGeographyValue9>10022</typ:BillToGeographyValue9>
					<typ:BillToGeocode>330612010</typ:BillToGeocode>
					<typ:BillToLocationId>300000005514535</typ:BillToLocationId>
					<typ:BillToPartyName>MCC Customer 1</typ:BillToPartyName>
					<typ:BillToPartyNumber>11009</typ:BillToPartyNumber>
					<typ:BillToSiteRegNumber>SiteRegLevel123</typ:BillToSiteRegNumber>
					<typ:CashDiscount>0</typ:CashDiscount>
					<typ:EntityCode>TRANSACTIONS</typ:EntityCode>
					<typ:EventClassCode>INVOICE</typ:EventClassCode>
					<typ:ExemptionControlFlag>S</typ:ExemptionControlFlag>
					<typ:LineAmt>0</typ:LineAmt>
					<typ:LineAmtIncludesTaxFlag>S</typ:LineAmtIncludesTaxFlag>
					<typ:LineClass>INVOICE</typ:LineClass>
					<typ:LineLevelAction>LINE_INFO_TAX_ONLY</typ:LineLevelAction>
					<typ:LinesDetFactorId>6035257</typ:LinesDetFactorId>
					<typ:MemoLineName>Tax-Only</typ:MemoLineName>
					<typ:OutputTaxClassificationCode>**VENDOR CHRG RATECD6**</typ:OutputTaxClassificationCode>
					<typ:PoaGeographyType1>ADDRESS1</typ:PoaGeographyType1>
					<typ:PoaGeographyType10>PROVINCE</typ:PoaGeographyType10>
					<typ:PoaGeographyType2>ADDRESS2</typ:PoaGeographyType2>
					<typ:PoaGeographyType3>ADDRESS3</typ:PoaGeographyType3>
					<typ:PoaGeographyType4>ADDRESS4</typ:PoaGeographyType4>
					<typ:PoaGeographyType5>COUNTRY</typ:PoaGeographyType5>
					<typ:PoaGeographyType6>STATE</typ:PoaGeographyType6>
					<typ:PoaGeographyType7>COUNTY</typ:PoaGeographyType7>
					<typ:PoaGeographyType8>CITY</typ:PoaGeographyType8>
					<typ:PoaGeographyType9>POSTALCODE</typ:PoaGeographyType9>
					<typ:PoaGeographyValue1>5430 One Shields Avenue</typ:PoaGeographyValue1>
					<typ:PoaGeographyValue5>US</typ:PoaGeographyValue5>
					<typ:PoaGeographyValue6>Pennsylvania</typ:PoaGeographyValue6>
					<typ:PoaGeographyValue8>Berwyn</typ:PoaGeographyValue8>
					<typ:PoaGeographyValue9>19312</typ:PoaGeographyValue9>
					<typ:PoaLocationId>300000001141673</typ:PoaLocationId>
					<typ:Precision>2</typ:Precision>
					<typ:ProductDescription>Tax-Only</typ:ProductDescription>
					<typ:ProductFiscClassification>Photography_Equipment</typ:ProductFiscClassification>
					<typ:ProductId>300000006345739</typ:ProductId>
					<typ:PseudoTrxLineFlag>N</typ:PseudoTrxLineFlag>
					<typ:ShipToGeographyType1>ADDRESS1</typ:ShipToGeographyType1>
					<typ:ShipToGeographyType10>PROVINCE</typ:ShipToGeographyType10>
					<typ:ShipToGeographyType2>ADDRESS2</typ:ShipToGeographyType2>
					<typ:ShipToGeographyType3>ADDRESS3</typ:ShipToGeographyType3>
					<typ:ShipToGeographyType4>ADDRESS4</typ:ShipToGeographyType4>
					<typ:ShipToGeographyType5>COUNTRY</typ:ShipToGeographyType5>
					<typ:ShipToGeographyType6>STATE</typ:ShipToGeographyType6>
					<typ:ShipToGeographyType7>COUNTY</typ:ShipToGeographyType7>
					<typ:ShipToGeographyType8>CITY</typ:ShipToGeographyType8>
					<typ:ShipToGeographyType9>POSTALCODE</typ:ShipToGeographyType9>
					<typ:ShipToGeographyValue1>32 Avenue Of The Americas</typ:ShipToGeographyValue1>
					<typ:ShipToGeographyValue5>US</typ:ShipToGeographyValue5>
					<typ:ShipToGeographyValue6>NY</typ:ShipToGeographyValue6>
					<typ:ShipToGeographyValue8>New York</typ:ShipToGeographyValue8>
					<typ:ShipToGeographyValue9>10013</typ:ShipToGeographyValue9>
					<typ:ShipToLocationId>300000004217049</typ:ShipToLocationId>
					<typ:ShipToPartyName>MCC Customer 1</typ:ShipToPartyName>
					<typ:ShipToPartyNumber>11009</typ:ShipToPartyNumber>
					<typ:TaxReportingFlag>Y</typ:TaxReportingFlag>
					<typ:TrxBusinessCategory>SALES_TRANSACTION</typ:TrxBusinessCategory>
					<typ:TrxId>593479</typ:TrxId>
					<typ:TrxLineCurrencyCode>USD</typ:TrxLineCurrencyCode>
					<typ:TrxLineDescription>Tax-Only</typ:TrxLineDescription>
					<typ:TrxLineGlDate>2022-09-30</typ:TrxLineGlDate>
					<typ:TrxLineId>300000029176896</typ:TrxLineId>
					<typ:TrxLineNumber>1</typ:TrxLineNumber>
					<typ:TrxLinePrecision>2</typ:TrxLinePrecision>
					<typ:TrxLineType>MISC</typ:TrxLineType>
					<typ:TrxLevelType>LINE</typ:TrxLevelType>
					<typ:TrxTypeDescription>Regular Invoice</typ:TrxTypeDescription>
				</typ:trxLine>
			</typ:trxLineList>
			<typ:trxDetailTaxLineList>
				<typ:trxDetailTaxLine>
					<typ:ApplicationId>222</typ:ApplicationId>
					<typ:CancelFlag>N</typ:CancelFlag>
					<typ:CompoundingTaxFlag>N</typ:CompoundingTaxFlag>
					<typ:CopiedFromOtherDocFlag>N</typ:CopiedFromOtherDocFlag>
					<typ:DeleteFlag>N</typ:DeleteFlag>
					<typ:EntityCode>TRANSACTIONS</typ:EntityCode>
					<typ:EventClassCode>INVOICE</typ:EventClassCode>
					<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
					<typ:LedgerId>300000001139008</typ:LedgerId>
					<typ:LegalEntityId>300000001140053</typ:LegalEntityId>
					<typ:LegalReportingStatus>000000000000000</typ:LegalReportingStatus>
					<typ:LineAmt>0</typ:LineAmt>
					<typ:LineAssessableValue>0</typ:LineAssessableValue>
					<typ:ManuallyEnteredFlag>Y</typ:ManuallyEnteredFlag>
					<typ:OffsetFlag>N</typ:OffsetFlag>
					<typ:OverriddenFlag>N</typ:OverriddenFlag>
					<typ:Precision>2</typ:Precision>
					<typ:ReportableFlag>Y</typ:ReportableFlag>
					<typ:ReportingOnlyFlag>N</typ:ReportingOnlyFlag>
					<typ:RoundingRuleCode>NEAREST</typ:RoundingRuleCode>
					<typ:SelfAssessedFlag>N</typ:SelfAssessedFlag>
					<typ:Tax>VENDOR CHARGED TAX</typ:Tax>
					<typ:TaxAmt>60</typ:TaxAmt>
					<typ:TaxAmtIncludedFlag>N</typ:TaxAmtIncludedFlag>
					<typ:TaxAmtTaxCurr>60</typ:TaxAmtTaxCurr>
					<typ:TaxApportionmentLineNumber>1</typ:TaxApportionmentLineNumber>
					<typ:TaxCurrencyCode>USD</typ:TaxCurrencyCode>
					<typ:TaxCurrencyConversionDate>2022-05-12</typ:TaxCurrencyConversionDate>
					<typ:TaxCurrencyConversionRate>1</typ:TaxCurrencyConversionRate>
					<typ:TaxDate>2022-05-12</typ:TaxDate>
					<typ:TaxDetermineDate>2022-05-12</typ:TaxDetermineDate>
					<typ:TaxJurisdictionCode>VTX_VND_CHRD_TAX_JURCD</typ:TaxJurisdictionCode>
					<typ:TaxLineId>300000029176906</typ:TaxLineId>
					<typ:TaxLineNumber>1</typ:TaxLineNumber>
					<typ:TaxOnlyLineFlag>N</typ:TaxOnlyLineFlag>
					<typ:TaxPointBasis>INVOICE</typ:TaxPointBasis>
					<typ:TaxRate>1</typ:TaxRate>
					<typ:TaxRateCode>***VENDOR CHRG TAX RATECDP2P***</typ:TaxRateCode>
					<typ:TaxRateType>PERCENTAGE</typ:TaxRateType>
					<typ:TaxRegimeCode>VERTEX COMMON TAX</typ:TaxRegimeCode>
					<typ:TaxStatusCode>STANDARD</typ:TaxStatusCode>
					<typ:TaxableAmt>6000</typ:TaxableAmt>
					<typ:TaxableAmtTaxCurr>6000</typ:TaxableAmtTaxCurr>
					<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
					<typ:TrxDate>2022-09-30</typ:TrxDate>
					<typ:TrxId>593479</typ:TrxId>
					<typ:TrxLevelType>LINE</typ:TrxLevelType>
					<typ:TrxLineId>300000029176896</typ:TrxLineId>
					<typ:UnroundedTaxAmt>60</typ:UnroundedTaxAmt>
					<typ:UnroundedTaxableAmt>6000</typ:UnroundedTaxableAmt>
				</typ:trxDetailTaxLine>
			</typ:trxDetailTaxLineList>
		</typ:calculation>
	</soapenv:Body>
</soapenv:Envelope>